[
  {
    "id": 1,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Include Indigenous seed banks as a central NbS approach.",
    "contributor": "Sara M. (Bolivia)",
    "status": "Under Review",
    "date": "2025-07-18",
    "votes": 7
  },
  {
    "id": 2,
    "pillar": "LD",
    "type": "Suggestion",
    "text": "Include indigenous youth. ",
    "contributor": "Agustin  (theglobalyouthcoalition@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-18",
    "votes": 0
  },
  {
    "id": 3,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Outline baseline data to benchmark NBS & hectors of land restored to showcase measurable growth coming out of the implementation of these suggestions. Partner with UNEP/UNEP-WCMC to establish baseline",
    "contributor": "Kathleen Arthur  (whattodayfeelslike@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-22",
    "votes": 0
  },
  {
    "id": 4,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Include youth initiatives in the Sharm el-Sheikh online portal that have being created based in  decision 3/CP.27 and will be used  to prepare the annual\nsynthesis report referred to in paragraph 15(a) of decision 3/CP.27",
    "contributor": "Juan Paredes (jsparedes@ecoaccion.org)",
    "status": "Under Review",
    "date": "2025-07-22",
    "votes": 0
  },
  {
    "id": 5,
    "pillar": "LD",
    "type": "Case-study",
    "text": "Evidence of Loss and Damage in Tanzania",
    "contributor": "Upendo Ernest Lyimo (upendolyimo@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 6,
    "pillar": "LD",
    "type": "Case-study",
    "text": "Evidence of Loss and Damage in Tanzania",
    "contributor": "Upendo Ernest Lyimo (upendolyimo@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 7,
    "pillar": "CET",
    "type": "Suggestion",
    "text": "What is decided in the GST Para 28 text is already agreed upon and will to my knowledge not be negotiated until the next GST? From my understanding the first segment is just a clarification of how the text from the para 28 is used into the JTWP text, but I found this a bit confusing. \n\nHence, I think we need to make a clearer link between the first part referencing para 28 from the GST and the fact that the language proposals made are referring to the JTWP Informal note. \n\nPerhaps just with a clarifying sentence under \n“Negotiation reference- SB62 Informal note - Just Transition Work Programme.” \nText suggestion: \nThe following language proposals regard this Informal note. \n\nAdditionally, there needs to be a reference indicating where the first “Original text” under “Key language proposal (based on paragraph 28)” is from - like it is done for the language proposals later on. Which para is it from? \n\nLast part of the first proposed revision - “consistent with local and intergenerational equity” - is this a part of the original text? It is not a part of the original text above. Should this then be marked red to indicate it is a proposal? Or is it just missing from the original text para? \n",
    "contributor": "Amalie Holmefjord",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 8,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "here's my personal (!) insights on NbS from SB62 and generally that I was advised to copy and paste straight into here: from my research into SB62 there wasn't anything big about nature other than oceans and SBSTA item 14 I think. Though I will say that I was a virtual delegate and did not attend in-person and so I may have missed stuff relevant to NbS. One thing I did virtually follow during SB was a session on synergies between the Rio conventions and integrated actions which had a good attendance. I personally still think more can be done to incorporate nature and NbS for example into mitigation and adaptation, though of course that's my personal opinion! From the avocado framework doc under the NbS section, I definitely agree with the bit on having strong safeguards especially with countries finalising rules for carbon trading under article 6 at SB62, some countries did raise this point and FPIC of Indigenous peoples during negotiations. But rights protection still isn't resolved yet and definitely needs more work especially if we want article 6 to be implemented on ground without inducing more human rights abuses otherwises that reduces the trust in NbS and gets into greenwashing etc. I also agree with mentioning CBD COP16 as one of the specific outcomes from there was more synergistic action with the UNFCCC to tackle both climate change and biodiversity loss. There’s some NbS/ecosystem related indicators for GGA but more could be done there. I personally also think that there can be more ambition and work on including nature in NDCs - as well as more broadly across the UNFCCC negotiation tracks as it interlinks strongly with areas e.g mitigation, agriculture etc - which is something that I haven't formally researched but I have a feeling that parties aren't doing enough of. As this is a good way to link together NDCs and NBSAPs (UNFCCC and CBD) rather than siloing efforts. As far as I'm aware nature wasn't on the agenda as much in COP29, and so the COP27 decision referenced in the avocado framework is a good one to have. I'm not sure if anything happened regarding nature at COP28 but I wasn't in the environmental space then and so I'm not too sure to be honest! :)   ",
    "contributor": "Harveet (harveet.purewal@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-29",
    "votes": 0
  }
]