[
  {
    "id": 1,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Include Indigenous seed banks as a central NbS approach.",
    "contributor": "Sara M. (Bolivia)",
    "status": "Under Review",
    "date": "2025-07-18",
    "votes": 7
  },
  {
    "id": 2,
    "pillar": "LD",
    "type": "Suggestion",
    "text": "Include indigenous youth. ",
    "contributor": "Agustin  (theglobalyouthcoalition@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-18",
    "votes": 0
  },
  {
    "id": 3,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Outline baseline data to benchmark NBS & hectors of land restored to showcase measurable growth coming out of the implementation of these suggestions. Partner with UNEP/UNEP-WCMC to establish baseline",
    "contributor": "Kathleen Arthur  (whattodayfeelslike@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-22",
    "votes": 0
  },
  {
    "id": 4,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Include youth initiatives in the Sharm el-Sheikh online portal that have being created based in  decision 3/CP.27 and will be used  to prepare the annual\nsynthesis report referred to in paragraph 15(a) of decision 3/CP.27",
    "contributor": "Juan Paredes (jsparedes@ecoaccion.org)",
    "status": "Under Review",
    "date": "2025-07-22",
    "votes": 0
  },
  {
    "id": 5,
    "pillar": "LD",
    "type": "Case-study",
    "text": "Evidence of Loss and Damage in Tanzania",
    "contributor": "Upendo Ernest Lyimo (upendolyimo@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 6,
    "pillar": "LD",
    "type": "Case-study",
    "text": "Evidence of Loss and Damage in Tanzania",
    "contributor": "Upendo Ernest Lyimo (upendolyimo@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 7,
    "pillar": "CET",
    "type": "Suggestion",
    "text": "What is decided in the GST Para 28 text is already agreed upon and will to my knowledge not be negotiated until the next GST? From my understanding the first segment is just a clarification of how the text from the para 28 is used into the JTWP text, but I found this a bit confusing. \n\nHence, I think we need to make a clearer link between the first part referencing para 28 from the GST and the fact that the language proposals made are referring to the JTWP Informal note. \n\nPerhaps just with a clarifying sentence under \n“Negotiation reference- SB62 Informal note - Just Transition Work Programme.” \nText suggestion: \nThe following language proposals regard this Informal note. \n\nAdditionally, there needs to be a reference indicating where the first “Original text” under “Key language proposal (based on paragraph 28)” is from - like it is done for the language proposals later on. Which para is it from? \n\nLast part of the first proposed revision - “consistent with local and intergenerational equity” - is this a part of the original text? It is not a part of the original text above. Should this then be marked red to indicate it is a proposal? Or is it just missing from the original text para? \n",
    "contributor": "Amalie Holmefjord",
    "status": "Under Review",
    "date": "2025-07-24",
    "votes": 0
  },
  {
    "id": 8,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "here's my personal (!) insights on NbS from SB62 and generally that I was advised to copy and paste straight into here: from my research into SB62 there wasn't anything big about nature other than oceans and SBSTA item 14 I think. Though I will say that I was a virtual delegate and did not attend in-person and so I may have missed stuff relevant to NbS. One thing I did virtually follow during SB was a session on synergies between the Rio conventions and integrated actions which had a good attendance. I personally still think more can be done to incorporate nature and NbS for example into mitigation and adaptation, though of course that's my personal opinion! From the avocado framework doc under the NbS section, I definitely agree with the bit on having strong safeguards especially with countries finalising rules for carbon trading under article 6 at SB62, some countries did raise this point and FPIC of Indigenous peoples during negotiations. But rights protection still isn't resolved yet and definitely needs more work especially if we want article 6 to be implemented on ground without inducing more human rights abuses otherwises that reduces the trust in NbS and gets into greenwashing etc. I also agree with mentioning CBD COP16 as one of the specific outcomes from there was more synergistic action with the UNFCCC to tackle both climate change and biodiversity loss. There’s some NbS/ecosystem related indicators for GGA but more could be done there. I personally also think that there can be more ambition and work on including nature in NDCs - as well as more broadly across the UNFCCC negotiation tracks as it interlinks strongly with areas e.g mitigation, agriculture etc - which is something that I haven't formally researched but I have a feeling that parties aren't doing enough of. As this is a good way to link together NDCs and NBSAPs (UNFCCC and CBD) rather than siloing efforts. As far as I'm aware nature wasn't on the agenda as much in COP29, and so the COP27 decision referenced in the avocado framework is a good one to have. I'm not sure if anything happened regarding nature at COP28 but I wasn't in the environmental space then and so I'm not too sure to be honest! :)   ",
    "contributor": "Harveet (harveet.purewal@gmail.com)",
    "status": "Under Review",
    "date": "2025-07-29",
    "votes": 0
  },
  {
    "id": 9,
    "pillar": "CET",
    "type": "Suggestion",
    "text": "(i) I completely agree with the suggestion of active, ongoing youth engagement in reviews and updates, as this is essential. However, I would specify that this youth engagement should be institutionalised with clear protocols or even a standing 'Youth Energy Advisory Board' at national level? (ii) For the MAPA Fast Track, I would consider adding follow-up support mechanisms after approvals, such as technical assistance or mentorship for MAPA-funded initiatives, to ensure maximum impact ? (iii) Lastly, regarding the shift from 'local communities' to 'locally led initiatives', I agree that this is both clearer and more sophisticated. However, I feel that you could further clarify this with examples, such as 'locally led energy cooperatives' or 'youth-organised solar programs' so people actually get it...",
    "contributor": "Kiara Winona Sweeney (kiara.winona.sweeney@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-04",
    "votes": 0
  },
  {
    "id": 10,
    "pillar": "LD",
    "type": "Suggestion",
    "text": "(i) I completely support mandating a youth seat on the Santiago Network’s Advisory Board, as I believe it is a key move for intergenerational equity. However, to make this truly effective, I think you would need to add that the selection process should be transparent and regularly rotated, ensuring a broad mix of voices and backgrounds are represented over time? (ii) Also I really like the idea of providing dedicated support for youth-led organisations and young practitioners in technical assistance. However, I'm wondering if there's a risk that these groups could still be sidelined by larger organisations if it's not already specified. Would it make sense to earmark a certain percentage of support or funding specifically for youth-led groups, to ensure they’re not crowded out? (iii) And lastly will there be any ongoing training and support tools for young and indigenous applicants in place? If not, I fear that could limit their ability to benefit fully from access... So maybe it would be helpful to explicitly recommend these kinds of capacity-building resources as part of the proposal?",
    "contributor": "Kiara Winona Sweeney (kiara.winona.sweeney@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-04",
    "votes": 0
  },
  {
    "id": 11,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "(i) I really like the suggestion to outline baseline data for tracking youth-led NBS initiatives, it’s concrete and makes progress measurable, but is there a plan to make partnerships with agencies like UNEP or UNEP-WCMC fully formalized and will there be annual reviews to ensure the data actually guides next steps? Otherwise, I would be worried that without formal agreements and regular assessments, this baseline data might not actually be consistently maintained (which is a lot of effort btw) or used effectively to actually inform decision-making and improve outcomes for youth-led NbS projects.... (ii) The idea of a Youth NbS Task Force and board seats is great for lasting engagement but I would go as far as even adding eligibility criteria (like age range, geographic or gender balance) and rotating term limits (for example, two-year terms) to really keep representation fresh and diverse? (iii) I completely agree with integrating nature and NbS more broadly across negotiation tracks like mitigation and agriculture but are there formal mechanisms proposed for this integration to prevent approaches from remaining siloed? (vi) And lastly on including Indigenous seed banks, I think it’s a great point. This is definitely not critical, but maybe you could consider setting up youth and indigenous 'knowledge hubs' for NbS best practices as a practical next step? Think that would be super beneficial (and cool :))!!",
    "contributor": "Kiara Winona Sweeney (kiara.winona.sweeney@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-04",
    "votes": 0
  },
  {
    "id": 12,
    "pillar": "GENERAL",
    "type": "Suggestion",
    "text": "Regarding the proposed:\n “Highlights developing country Parties’ need for enhanced support for developing and implementing NDCs, NAPs and LT-LEDS that incorporate consideration of just transition pathways, including the active participation of youth, and acknowledges the support already available in this regard”\n\nPossible push back is that youth is not the only vulnerable group - women,disabled people and indigenous people also face disproportionate adverse impacts from climate change. Consequently, if the proposal is received, it will be watered down in terms of the youth focus to ensure that everyone (and rightly so) has a seat at the table in influencing policy \n\nTo make the link to youth strong I would call for a separate paragraph which notes the principles of intragenerational and intergenerational equity, imposing a duty on \"older\" leaders to give the youth an opportunity to directly input into medium to long-term strategies like NAPS and NDCs. This will ensure that the action plans are undertaken in future because it has buy-in from those people (i.e. the youth) who are likely going to be the ones driving the implementation of these strategies in future.",
    "contributor": "Kirstin (meiringkirstin@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-05",
    "votes": 0
  },
  {
    "id": 13,
    "pillar": "GENERAL",
    "type": "Edit",
    "text": "Regarding the Proposed:\n “Recognizes the importance of means of implementation, including capacity-building, tailored application processes for climate financing for youth, and technology development and transfer...”\n\nI would propose that the wording is tailored. Right now the meaning is unclear. This point relates to access.\nThe youth barred from having meaningful access to drive change and requires the mobilisation of climate finance and for our opinions to be formally tabled.",
    "contributor": "Kirstin Meiring (meiringkirstin@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-05",
    "votes": 0
  },
  {
    "id": 14,
    "pillar": "NBS",
    "type": "Suggestion",
    "text": "Regarding the Proposed:\n “Indicators for means of implementation including youth-led nature-based solutions are to be included, measuring:\n– % of NbS projects co-designed/by youth (ages 15–30) in local adaptation plans;\n– Hectares of ecosystems restored/maintained by youth-led NbS initiatives;\n– Funding allocated to youth NBS entrepreneurship (e.g., mangrove nurseries, urban greening such as wetland development for natural sewage systems).”\n\nHaving been engaged in discussions on the formulation and streamlining of MOI indicators, I would ensure that the linkage to the specific GGA target is clear. 3 indicators seem like a reasonable ask on behalf of the youth - I would just bear in mind that Parties will likely need to reduce the number of their indicators, so it is good to keep the number of indicators as targeted as possible.",
    "contributor": "Kirstin Meiring  (meiringkirstin@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-05",
    "votes": 0
  },
  {
    "id": 15,
    "pillar": "NBS",
    "type": "Edit",
    "text": "Regarding \"Reserving 2 board seats for youth representatives (ages 18–30) in adaptation finance decisions.”\n\nPlease extend this to age 35 rather than 30",
    "contributor": "Kirstin Meiring  (meiringkirstin@gmail.com)",
    "status": "Under Review",
    "date": "2025-08-05",
    "votes": 0
  }
]